Project/Toir/src/Documents/гкс_ЕВОБланк/гкс_ЕВОБланк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ЕВОБланк</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <registerRecords>InformationRegister.гкс_ОжидаемыеМероприятияЕвобланк</registerRecords>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневаяПричина</name>
    <type>
      <types>CatalogRef.гкс_КорневыеПричины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКорневойПричины</name>
    <type>
      <types>CatalogRef.гкс_ТипыКорневыхПричин</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВызоваТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНеисправности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыПринятые</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневаяПричинаТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазборТребуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕвоБланкПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОстанова</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальникСмены</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиаграммаСобытий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроблемы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроблем</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтветственности</name>
    <type>
      <types>EnumRef.гкс_ЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ПовторныйОтказ</name>
    <comment>TOIR20-534</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МероприятияПоПредупреждению</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <comment>TOIR20-462</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Срок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АнализПричины</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РодительИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорневаяПричина</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/гкс_ДополнительныеСвойстваСтатусов/гкс_ДополнительныеСвойстваСтатусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ДополнительныеСвойстваСтатусов</name>
  <resources>
    <name>ЕВОБланкНаДоработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <enumValues>
    <name>торо_ВыявленныеДефекты</name>
  </enumValues>
  <enumValues>
    <name>торо_АктОВыполненииЭтапаРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланГрафикРемонта</name>
  </enumValues>
  <enumValues>
    <name>торо_ЗаявкаНаРемонт</name>
  </enumValues>
  <enumValues>
    <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ВнешнееОснованиеДляРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_АктПриемкиОборудования</name>
  </enumValues>
  <enumValues>
    <name>торо_ОстановочныеРемонты</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланРаботПодразделения</name>
  </enumValues>
  <enumValues>
    <name>гкс_ЕВОБланк</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/гкс_ЗоныОтветственности/гкс_ЗоныОтветственности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ЗоныОтветственности</name>
  <enumValues>
    <name>ОтделПланированияТОиР</name>
  </enumValues>
  <enumValues>
    <name>Механики</name>
  </enumValues>
  <enumValues>
    <name>АСУТП</name>
  </enumValues>
  <enumValues>
    <name>ИСЗиС</name>
  </enumValues>
  <enumValues>
    <name>КИПиА</name>
  </enumValues>
  <enumValues>
    <name>Метрология</name>
  </enumValues>
  <enumValues>
    <name>ПСиГХ</name>
  </enumValues>
  <enumValues>
    <name>ВОиК</name>
  </enumValues>
  <enumValues>
    <name>ВКиАО</name>
  </enumValues>
  <enumValues>
    <name>Электрики</name>
  </enumValues>
  <enumValues>
    <name>РМУ_ЦКОО</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Технология</name>
  </enumValues>
  <enumValues>
    <name>СЗМОиУ</name>
  </enumValues>
  <enumValues>
    <name>СервиснаяКомпания</name>
  </enumValues>
  <enumValues>
    <name>Внешняя</name>
  </enumValues>
  <enumValues>
    <name>НеОпределена</name>
  </enumValues>
  <enumValues>
    <name>ОтделПоНадежностиОборудования</name>
    <comment>TOIR20-805</comment>
  </enumValues>
  <enumValues>
    <name>СлужбаИТОтделАдминистрирования</name>
    <comment>TOIR20-805</comment>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_СпособыСогласованияДокументов/торо_СпособыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СпособыСогласованияДокументов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Упр)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокСогласования</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>_Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ПроводитьАвтоматически</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замещающие</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОповещаемыеЛица</name>
    <attributes>
      <name>ТекущийСтатус</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещаемоеЛицо</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Documents/гкс_ЕВОБланк/Forms/ФормаДокумента/Module.bsl
#Область Согласование
// согласование++
&НаКлиенте
Процедура СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если СогласующиеРегистр.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("Элемент",Элемент)),
		НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"),
		РежимДиалогаВопрос.ДаНет, 60);		
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияОчистка(Элемент, СтандартнаяОбработка)
	Если Элемент.Значение = ПредопределенноеЗначение("Справочник.торо_СпособыСогласованияДокументов.ПустаяСсылка") Тогда
		фПослеОчистки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияПриИзменении(Элемент)
	
	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;
	
	УправлениеВидимостьюСогласование(ЭтотОбъект);
	// гкс+ [10.23] Деснол 27.05.2024
	гкс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
	// гкс- [10.23] Деснол 27.05.2024
КонецПроцедуры
// согласование--
&НаСервере
Процедура ЗавершитьУтверждениеСтатусаДокумента(ПараметрыОповещения)
	
	торо_РаботаССогласованиями.ЗавершитьУтверждениеСтатусаДокумента(ЭтаФорма, ПараметрыОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоСогласующих(НовыйСпособСогласования = Ложь)
	
	торо_РаботаССогласованиями.ОбновитьДеревоСогласующих(ЭтаФорма, НовыйСпособСогласования);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюСогласование(ДокОбъект)
	Элементы = ДокОбъект.Элементы;
	Объект = ДокОбъект.Объект;
	Элементы.ДеревоСогласованияУтвердитьСтатус.Доступность = ЗначениеЗаполнено(Объект.СпособСогласования);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСтатусовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	торо_РаботаССогласованиямиКлиент.ОткрытьЗаписьИсторииСтатусов(ЭтаФорма, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьСтатус(Команда)
	торо_РаботаССогласованиямиКлиент.УстановитьСтатус(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОтправитьНаСогласование(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Параметры1 = Новый Структура("дс_Выполнить", Истина);
		Параметры2 = Новый Структура();
		
		гкс_ОбщегоНазначенияСервер.ОтправитьНаСогласованиеНаСервере(Параметры1, Параметры2);
		Если Параметры1.дс_Выполнить Тогда 
			Параметры2.Вставить("Форма", ЭтотОбъект);
			торо_РаботаССогласованиямиКлиент.ВыбратьСтатусЗавершение(Параметры1, Параметры2);
			гкс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура гкс_ИзменитьВидимостьКнопкиОтправкиНаСогласование()
	гкс_ОбщегоНазначенияСервер.ИзменитьВидимостьКнопкиОтправкиНаСогласование(Элементы["гкс_ОтправитьНаСогласование"],СтатусДокументаРегистр);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДокументОснование") Тогда 
		Объект.ДокументОснование = Параметры.ДокументОснование;
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда 
			торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(Объект);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) = Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Документ основание отсутствует'");
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		#Область ЕвоБланк
		Если Параметры.Свойство("Подразделение") Тогда 
			Объект.Подразделение = Параметры.Подразделение;
		КонецЕсли;
		Если Параметры.Свойство("Организация") Тогда 
			Объект.Организация = Параметры.Организация;
		КонецЕсли;
		Если Параметры.Свойство("ДефектОписание") Тогда 
			Объект.ДефектОписание = Параметры.ДефектОписание;
		КонецЕсли;
		Если Параметры.Свойство("ВидДефекта") Тогда 
			Объект.ВидДефекта = Параметры.ВидДефекта;
		КонецЕсли;
		Если Параметры.Свойство("КорневаяПричина") Тогда 
			Объект.КорневаяПричина = Параметры.КорневаяПричина;
		КонецЕсли;
		Если Параметры.Свойство("ДатаОбнаружения") Тогда 
			Объект.ДатаОбнаружения = Параметры.ДатаОбнаружения;
		КонецЕсли;
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Если Параметры.Свойство("Подразделение") И Не ЗначениеЗаполнено(Объект.Подразделение) Тогда 
			Объект.Подразделение = Параметры.Подразделение;
			Модифицированность = Истина;
		КонецЕсли;
		Если Параметры.Свойство("Организация") И Не ЗначениеЗаполнено(Объект.Организация) Тогда 
			Объект.Организация = Параметры.Организация;
			Модифицированность = Истина;
		КонецЕсли;
		#КонецОбласти
	КонецЕсли;
	//
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаГлобальные;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Согласование++
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.гкс_ЕВОБланк;
	торо_РаботаССогласованиями.ПриСозданииНаСервере(ЭтаФорма, ВидДокумента);
	УправлениеВидимостьюСогласование(ЭтотОбъект);
	// Согласование --
	
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
	
	ПолучитьАктуальныеДанные();
	#Область НовыеЭлементы
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.ГруппаНомер,
		Новый Структура("гкс_РеквизитыДаты", 
		"Дата,ВремяНачалаОстановки,ВремяВызоваТС,ВремяЗапуска,ВремяНачалаТС,ВремяОкончанияТС"));
		
	Элементы.ФункциональноеМестодс_Завод.Видимость = Ложь;
	Элементы.ФункциональноеМестодс_Участок.Видимость = Ложь;
	Элементы.ВидНеисправности.Видимость = Ложь;
	Элементы.ВидДефекта.Видимость = Ложь;
	Элементы.ГруппаМеры.Видимость = Ложь;
	Элементы.ОписаниеПроблемы.Видимость = Ложь;
	Элементы.КорневаяПричина.Видимость = Ложь;
	Элементы.ГруппаДаты.Видимость = Ложь;
	//
	НЭлем = Элементы.Добавить("ДатаОбнаружения", Тип("ПолеФормы"), Элементы.ГруппаНомер);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.ДатаОбнаружения";
	//
	НЭлем = Элементы.Добавить("НачальникСмены", Тип("ПолеФормы"), Элементы.ГруппаНомер);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.НачальникСмены";
	
	
	НГруп = Элементы.Добавить("ГруппаШ1_1_1", Тип("ГруппаФормы"), Элементы.ГруппаШ1_1);
	НГруп.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НГруп.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НГруп.ОтображатьЗаголовок = Ложь;
	
	// Гкс+[TOIR20-526] Вялых Д.А. от 07.02.2025. Добавлено:{
	НЭлем = Элементы.Добавить("гкс_ЗонаОтветственности", Тип("ПолеФормы"), Элементы.ГруппаШ1_1_1);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.ЗонаОтветственности";
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_ЗонаОтветственностиПриИзменении");
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	// } Гкс-[TOIR20-526] Вялых Д.А. от 07.02.2025.
	
	// Гкс+[TOIR20-520] Вялых Д.А. от 29.01.2025. Добавлено и закомментировано:{
	//НЭлем = Элементы.Добавить("гкс_ВидНеисправности", Тип("ПолеФормы"), Элементы.ГруппаШ1_1);
	НЭлем = Элементы.Добавить("гкс_ВидНеисправности", Тип("ПолеФормы"), Элементы.ГруппаШ1_1_1);
	НЭлем.Видимость = Ложь;
	// } Гкс-[TOIR20-520] Вялых Д.А. от 29.01.2025.
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.ВидНеисправности";
	НЭлем.Заголовок = "Зона ответственности";
	НЭлем.РежимВыбораИзСписка = Истина;
	НЭлем.РедактированиеТекста = Ложь;
	// Гкс+[TOIR20-520] Вялых Д.А. от 29.01.2025. Добавлено:{
	НЭлем.СписокВыбора.Добавить("Механическая");
	НЭлем.СписокВыбора.Добавить("Электрическая");
	//// Гкс+[TOIR20-455] Зозуля А.В. от 08.10.2024. Добавлено:{
	НЭлем.СписокВыбора.Добавить("Технологическая");
	//// } Гкс-[TOIR20-455] Зозуля А.В. от 08.10.2024.
	//НЭлем.СписокВыбора.Добавить("АСУП");
	//НЭлем.СписокВыбора.Добавить("Производственный персонал");
	НЭлем.СписокВыбора.Добавить("Отдел планирования ТОиР");
	НЭлем.СписокВыбора.Добавить("Механики");
	НЭлем.СписокВыбора.Добавить("АСУТП");
	НЭлем.СписокВыбора.Добавить("ИСЗиС");
	НЭлем.СписокВыбора.Добавить("КИПиА");
	НЭлем.СписокВыбора.Добавить("Метрология");
	НЭлем.СписокВыбора.Добавить("ПСиГХ");
	НЭлем.СписокВыбора.Добавить("ВОиК");
	НЭлем.СписокВыбора.Добавить("ВКиАО");
	НЭлем.СписокВыбора.Добавить("Электрики");
	НЭлем.СписокВыбора.Добавить("РМУ/ЦКОО");
	НЭлем.СписокВыбора.Добавить("Производство");
	НЭлем.СписокВыбора.Добавить("Технология");
	НЭлем.СписокВыбора.Добавить("СЗМОиУ");
	НЭлем.СписокВыбора.Добавить("Сервисная компания");
	НЭлем.СписокВыбора.Добавить("Внешняя");
	НЭлем.СписокВыбора.Добавить("Не определена");
	// } Гкс-[TOIR20-520] Вялых Д.А. от 29.01.2025.	
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	
	// Гкс+[TOIR20-520] Вялых Д.А. от 29.01.2025. Добавлено:{
	НЭлем = Элементы.Добавить("ТипПроблемы", Тип("ПолеФормы"), Элементы.ГруппаШ1_1_1);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.ТипПроблемы";
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	// } Гкс-[TOIR20-520] Вялых Д.А. от 29.01.2025.
	//
	//
	НЭлем = Элементы.Вставить("ДефектОписание", Тип("ПолеФормы"),, Элементы.ОписаниеПроблемы);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.ДефектОписание";
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.МногострочныйРежим = Истина;
	//
	НЭлем = Элементы.Вставить("МерыПринятые", Тип("ПолеФормы"),, Элементы.ОписаниеПроблемы);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.МерыПринятые";
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.МногострочныйРежим = Истина;
	//
	НЭлем = Элементы.Вставить("КорневаяПричинаТекст", Тип("ПолеФормы"), Элементы.Группа2, Элементы.КорневаяПричина);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.КорневаяПричинаТекст";
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.МногострочныйРежим = Истина;
	//
	НЭлем = Элементы.Вставить("ДиаграммаСобытий", Тип("ПолеФормы"), Элементы.Группа2, Элементы.ВидДефекта);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.ДиаграммаСобытий";
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	НЭлем.МногострочныйРежим = Истина;
	НЭлем.АвтоОтметкаНезаполненного = Истина;
	//
	НЭлем = Элементы.Добавить("РазборТребуется", Тип("ПолеФормы"), Элементы.ГруппаНомер);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.РазборТребуется";
	НЭлем.УстановитьДействие("ПриИзменении", "РазборТребуетсяПриИзменении");
	//
	НЭлем = Элементы.Добавить("ЕвоБланкПринят", Тип("ПолеФормы"), Элементы.ГруппаНомер);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.ЕвоБланкПринят";
	//
	//
	НЭлем = Элементы.Добавить("МероприятияПоПредупреждению_Выполнено", Тип("ПолеФормы"), Элементы.МероприятияПоПредупреждению);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.МероприятияПоПредупреждению.Выполнено";
	//
	НЭлем = Элементы.Добавить("МероприятияПоПредупреждению_Комментарий", Тип("ПолеФормы"), Элементы.МероприятияПоПредупреждению);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.МероприятияПоПредупреждению.Комментарий";
	//
	НЭлем = Элементы.Добавить("УровеньОстанова", Тип("ПолеФормы"), Элементы.ГруппаШ1_1);
	НЭлем.Вид = ВидПоляФормы.ПолеПереключателя;
	НЭлем.Видпереключателя = ВидПереключателя.Тумблер;
	НЭлем.ПутьКДанным = "Объект.УровеньОстанова";
	НЭлем.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	СписокВыбора = НЭлем.СписокВыбора;
	гкс_ЗаполнитьСписокУровняОстанова(Объект.ЗонаОтветственности, СписокВыбора);
	//
	// гкс+ [10.23] Деснол 18.03.2024
	//НЭлем.СписокВыбора.Добавить(0, "Без останова оборудования");
	НЭлем.УстановитьДействие("ПриИзменении", "УровеньОстановаПриИзменении");
	Если Объект.УровеньОстанова = 0 Тогда 
		Объект.УровеньОстанова = 3;
	КонецЕсли;
	// гкс- [10.23] Деснол 18.03.2024
	//
	НГруп = Элементы.Добавить("ГруппаПериодОстанова", Тип("ГруппаФормы"), Элементы.ГруппаШ1_1);
	НГруп.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НГруп.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НГруп.Видимость = Объект.УровеньОстанова > 0;
	НГруп.ОтображатьЗаголовок = Ложь;
	//
	НЭлем = Элементы.Добавить("гкс_ВремяНачалаОстановки", Тип("ПолеФормы"), Элементы.ГруппаПериодОстанова);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.ВремяНачалаОстановки";
	НЭлем.Заголовок = "Период останова: начало";
	// Гкс+[TOIR20-520] Вялых Д.А. от 29.01.2025. Добавлено:{
	НЭлем.АвтоОтметкаНезаполненного = Истина; 
	// } Гкс-[TOIR20-520] Вялых Д.А. от 29.01.2025.
	//
	НЭлем = Элементы.Добавить("гкс_ВремяЗапуска", Тип("ПолеФормы"), Элементы.ГруппаПериодОстанова);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.ВремяЗапуска";
	НЭлем.Заголовок = "окончание";
	//
	НЭлем = Элементы.Добавить("гкс_ОтказавшийЭлемент_ТехНомер", Тип("ПолеФормы"), Элементы.ГруппаШ1_3);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "ОтказавшийЭлемент.ТехНомер";
	НЭлем.ТолькоПросмотр = Истина;
	//
	НЭлем = Элементы.Добавить("гкс_Комментарий", Тип("ПолеФормы"));
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.Комментарий";
	НЭлем.АвтоМаксимальнаяШирина = Ложь;
	//
	НГруп = Элементы.Добавить("ГруппаПериодТС", Тип("ГруппаФормы"), Элементы.ГруппаШ1_1);
	НГруп.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НГруп.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НГруп.ОтображатьЗаголовок = Ложь;
	//
	Элементы.Переместить(Элементы.ВремяВызоваТС, Элементы.ГруппаПериодТС);
	НЭлем = Элементы.Добавить("гкс_ВремяНачалаТС", Тип("ПолеФормы"), Элементы.ГруппаПериодТС);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.ВремяНачалаТС";
	//
	НЭлем = Элементы.Добавить("гкс_ВремяОкончанияТС", Тип("ПолеФормы"), Элементы.ГруппаПериодТС);
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.ПутьКДанным = "Объект.ВремяОкончанияТС";
	// гкс+ [10.23] Деснол 18.03.2024
	НоваяКоманда = Команды.Добавить("гкс_ОтправитьУведомленияПоМероприятиям");
	НоваяКоманда.Действие = "гкс_ОтправитьУведомленияПоМероприятиям";
	НоваяКоманда.Заголовок = "Отправить уведомления";
	//
	НоваяКнопка = Элементы.Добавить("гкс_ОтправитьУведомленияПоМероприятиям_Кнопка", Тип("КнопкаФормы"), 
		Элементы.МероприятияПоПредупреждениюКоманднаяПанель);
	НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопка.ИмяКоманды = "гкс_ОтправитьУведомленияПоМероприятиям";
	// гкс- [10.23] Деснол 18.03.2024
	// гкс+ [10.23] Деснол 09.04.2024
	НоваяКоманда = Команды.Добавить("гкс_ОтправитьНаСогласование");
	НоваяКоманда.Действие = "гкс_ОтправитьНаСогласование";
	НоваяКоманда.Заголовок = НСтр("ru='Отправить на согласование';en='Send for approval'");
	//
	НоваяКнопкаФормы = Элементы.Добавить("гкс_ОтправитьНаСогласование",Тип("КнопкаФормы"),Элементы.ФормаКоманднаяПанель);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "гкс_ОтправитьНаСогласование";
	Элементы.Переместить(Элементы["гкс_ОтправитьНаСогласование"],Элементы.ФормаКоманднаяПанель,Элементы.ФормаПроведение);
	гкс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
	// гкс- [10.23] Деснол 09.04.2024
	// гкс+ [10.23] Деснол 18.04.2024
	НоваяКоманда = Команды.Добавить("ОткрытьПоискКорневойПричины");
	НоваяКоманда.Действие = "ОткрытьПоискКорневойПричины";
	НоваяКоманда.Заголовок = "Поиск корневой причины";
	//
	НоваяКнопка = Элементы.Добавить("ОткрытьПоискКорневойПричины_Кнопка", Тип("КнопкаФормы"), Элементы.Группа2);
	НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопка.ИмяКоманды = "ОткрытьПоискКорневойПричины";
	// гкс- [10.23] Деснол 18.04.2024
	
	// Гкс+[TOIR20-534] Зозуля А.В. от 21.02.2025. Добавлено:{
    НЭлем = Элементы.Добавить("гкс_ПовторныйОтказ", Тип("ПолеФормы"), Элементы.ГруппаНомер);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.ПутьКДанным = "Объект.гкс_ПовторныйОтказ";
	// } Гкс-[TOIR20-534] Зозуля А.В. от 21.02.2025.
	
	#КонецОбласти
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// ++евобланк
	Если Объект.РазборТребуется И Не гкс_СтатусНаДоработке(СтатусДокументаРегистр) Тогда 
		Если Объект.МероприятияПоПредупреждению.Количество() = 0 Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Таблица мероприятий не заполнена";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если Объект.АнализПричины.Количество() = 0 Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Таблица ""Анализ корневой причины"" не заполнена";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если СокрЛП(Объект.КорневаяПричинаТекст) = "" Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Корневая причина не указана";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ТипКорневойПричины) Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Тип корневой причины не указан";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ДиаграммаСобытий) Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Диаграмма событий не указана";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если Объект.УровеньОстанова > 0 Тогда 
		Если Не ЗначениеЗаполнено(Объект.ВремяНачалаОстановки) Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Начало периода останова не указано";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// Гкс+[TOIR20-520] Вялых Д.А. от 29.01.2025. Добавлено:{ 
	Если Не ЗначениеЗаполнено(Объект.ТипПроблемы) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Тип проблемы не указан";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	// } Гкс-[TOIR20-520] Вялых Д.А. от 29.01.2025.
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	// --евобланк
		
	// Согласование++
	торо_РаботаССогласованиями.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--
	
	// гкс+ [Часовые пояса] Куст 14.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПСервера(ЭтаФорма,, ТекущийОбъект);
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Согласование++
	торо_РаботаССогласованиями.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--
	
	// гкс+ [Часовые пояса] Куст 14.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, ТекущийОбъект);
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// гкс+ [Часовые пояса] Куст 14.04.2020
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, Объект);
	КонецЕсли;
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПриОткрытииНаСервере(ТекущаяДата());
	// ++ евобланк
	РазборТребуетсяПриИзменении(Неопределено);
	// --евобланк
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(ДатаКлиента)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	// гкс+ [Часовые пояса] Куст 14.04.2020
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,,,);
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
	// гкс- [Часовые пояса] Куст 14.04.2020
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Согласование++
	Если ИмяСобытия = "УтверждениеСтатусаСогласования" Тогда
		Если Параметр.Документ = Объект.Ссылка Тогда
			ЗавершитьУтверждениеСтатусаДокумента(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Согласование--
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура РемонтныеРаботыПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.РемонтныеРаботы.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		Если ТекДанные.НомерТК = 0 Тогда 
			Элементы.МатЗатраты.ОтборСтрок = Неопределено;
		Иначе
			Элементы.МатЗатраты.ОтборСтрок = Новый ФиксированнаяСтруктура("НомерТК",ТекДанные.НомерТК);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьАктуальныеДанные()
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	
	ТекСтруктура = Документы.гкс_ЕВОБланк.ПолучитьАктуальнуюСтруктуру(Объект.ДокументОснование, 
		?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено));
	Завод = ТекСтруктура.Завод;
	Участок = ТекСтруктура.Участок;
	Если ЗначениеЗаполнено(Объект.ВидДефекта) = Ложь Тогда 
		Объект.ВидДефекта = ТекСтруктура.ВидНеисправности;
	КонецЕсли;
	ВидНеисправности = ТекСтруктура.ВидНеисправности;
	Влияние = ТекСтруктура.Влияние;
	ОписаниеПроблемы = ТекСтруктура.ОписаниеПроблемы;
	ОтказавшийЭлемент = ТекСтруктура.ОтказавшийЭлемент;
	ФункциональноеМесто = ТекСтруктура.ФункциональноеМесто;
	ВремяНачалаРаботыТС = ТекСтруктура.ВремяНачалаРаботыТС + (СдвигЧП * 3600);
	ВремяОкончанияРаботыТС = ТекСтруктура.ВремяОкончанияРаботыТС + (СдвигЧП * 3600);
	Объект.ДатаОбнаружения = ТекСтруктура.ДатаОбнаружения;
	//
	МатЗатраты.Загрузить(ТекСтруктура.МатЗатраты);
	Корень = РемонтныеРаботы.ПолучитьЭлементы();
	НоваяСтрока = Корень.Добавить();
	НоваяСтрока.НомерТК = 0;
	НоваяСтрока.ТехКарта = Неопределено;
	Корень = НоваяСтрока.ПолучитьЭлементы();
	Для Каждого СтрокаТаблицы Из ТекСтруктура.РемонтныеРаботы Цикл
		НоваяСтрока = Корень.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюОборудования(Команда)
	ТекДата = ?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата());
	ПараметрыОтчет = Новый Структура();
	Отборы = Новый Структура();
	Отборы.Вставить("ОбъектРемонта",ФункциональноеМесто);	
	Отборы.Вставить("Период",Новый СтандартныйПериод(НачалоНедели(ТекДата),КонецНедели(ТекДата)));
	ПараметрыОтчет.Вставить("ПараметрыОтбора",Отборы);
	
	ОткрытьФорму("Отчет.торо_ИсторияОстановаЗапускаОборудования.Форма",Новый Структура("ПараметрыОтчета,СформироватьПриОткрытии", ПараметрыОтчет,Истина));

КонецПроцедуры

&НаКлиенте
Процедура РазборТребуетсяПриИзменении(Элемент)
	// Гкс+[TOIR20-455] Зозуля А.В. от 08.10.2024. Удалено:{
	//Если Объект.УровеньОстанова = 1 ИЛИ Объект.УровеньОстанова = 2 Тогда 
	//	Объект.РазборТребуется = Истина;
	//КонецЕсли;
	// } Гкс-[TOIR20-455] Зозуля А.В. от 08.10.2024.
	Элементы.Группа2.Доступность = Объект.РазборТребуется;
	Элементы.МероприятияПоПредупреждению.Доступность = Объект.РазборТребуется;
	Элементы.КорневаяПричинаТекст.АвтоотметкаНезаполненного = Объект.РазборТребуется;
	Элементы.ТипКорневойПричины.АвтоотметкаНезаполненного = Объект.РазборТребуется;
КонецПроцедуры

&НаКлиенте
Процедура УровеньОстановаПриИзменении(Элемент)
	// Гкс+[TOIR20-455] Зозуля А.В. от 08.10.2024. Удалено:{
	//Если Объект.УровеньОстанова = 1 ИЛИ Объект.УровеньОстанова = 2 Тогда 
	//	Объект.РазборТребуется = Истина;
	//	РазборТребуетсяПриИзменении(Неопределено);
	//КонецЕсли;
	// } Гкс-[TOIR20-455] Зозуля А.В. от 08.10.2024.
	Элементы.ГруппаПериодОстанова.Видимость = Объект.УровеньОстанова > 0;
КонецПроцедуры

&НаКлиенте
Процедура гкс_ЗонаОтветственностиПриИзменении()
	
	СписокВыбора = Элементы.УровеньОстанова.СписокВыбора;
	гкс_ЗаполнитьСписокУровняОстанова(Объект.ЗонаОтветственности, СписокВыбора);
			
КонецПроцедуры

// гкс+ [10.23] Деснол 18.03.2024
&НаКлиенте
Процедура гкс_ОтправитьУведомленияПоМероприятиям(Команда)
	ОпОп = Новый ОписаниеОповещения("гкс_ОтправитьУведомленияПослеВопроса", ЭтотОбъект);
	// Гкс+[TOIR20-455] Зозуля А.В. от 08.10.2024. Изменено:{
	//ПоказатьВопрос(ОпОп, "Уведоления будут отправлены для невыполненных и наступивших мороприятий. Продолжить?", РежимДиалогаВопрос.ДаНет);
	ПоказатьВопрос(ОпОп, "Уведомления будут отправлены для невыполненных и наступивших мероприятий. Продолжить?", РежимДиалогаВопрос.ДаНет);
	// } Гкс-[TOIR20-455] Зозуля А.В. от 08.10.2024.
КонецПроцедуры// гкс- [10.23] Деснол 18.03.2024

// гкс+ [10.23] Деснол 18.03.2024
&НаКлиенте
Процедура гкс_ОтправитьУведомленияПослеВопроса(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		гкс_ОтправитьУведомленияНаСервере();
	КонецЕсли;
КонецПроцедуры // гкс- [10.23] Деснол 18.03.2024

// гкс+ [10.23] Деснол 18.03.2024
&НаСервере
Процедура гкс_ОтправитьУведомленияНаСервере() Экспорт
	Событие = Константы.гкс_СобытиеПросрочкиМероприятияЕвобланк.Получить();
	Если Не ЗначениеЗаполнено(Событие) Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Уведомление не настроено";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	//
	МассивСтрок = Новый Массив();
	КолвоУспех = 0;
	ТекДата = ТекущаяДата();
	Для Каждого СтрокаТЧ Из Объект.МероприятияПоПредупреждению Цикл
		Если Не СтрокаТЧ.Выполнено И СтрокаТЧ.Срок < ТекДата Тогда 
			МассивСтрок.Добавить(Новый Структура("Ответственный,Мероприятие", СтрокаТЧ.Ответственный, СтрокаТЧ.Мероприятие));
		КонецЕсли;
	КонецЦикла;
	Если МассивСтрок.Количество() Тогда 
		ОбМодуль = торо_РаботаСУведомлениями;
		ДокОб = Объект.Ссылка.ПолучитьОбъект();
		СтруктураДанных = Новый Структура();
		торо_РаботаСУведомлениями.ЗаполнитьСтруктуруДанныхДокумента(СтруктураДанных, ДокОб);
		СтруктураДанных.Вставить("ВидДокумента", "гкс_ЕВОБланк");
		Для Каждого СМ Из МассивСтрок Цикл
			СтруктураДанных.Вставить("Ответственный", СМ.Ответственный);
			СтруктураДанных.Вставить("Мероприятие", СМ.Мероприятие);
			ОбМодуль.ЗаписатьУведомленияФМ(СтруктураДанных, Событие);
			КолвоУспех = КолвоУспех + 1;
		КонецЦикла;
	КонецЕсли;
	Если КолвоУспех = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Нет просроченных мероприятий";
		Сообщение.Сообщить();
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Отправлено уведомлений: " + КолвоУспех;
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры // гкс- [10.23] Деснол 18.03.2024

&НаСервереБезКонтекста
Функция гкс_СтатусНаДоработке(Статус)
	Если Не ЗначениеЗаполнено(Статус) Тогда 
		Возврат Истина;
	КонецЕсли;
	НЗ = РегистрыСведений.гкс_ДополнительныеСвойстваСтатусов.СоздатьНаборЗаписей();
	НЗ.Отбор.Статус.Установить(Статус);
	НЗ.Прочитать();
	Если НЗ.Количество() Тогда 
		Возврат НЗ[0].ЕВОБланкНаДоработке;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ОткрытьПоискКорневойПричины(Команда)
	ОпОп = Новый ОписаниеОповещения("СохранитьАнализПричин", ЭтотОбъект);
	ТемпМассив = Новый Массив();
	Для Каждого СТ Из Объект.АнализПричины Цикл
		ТемпСтрукт = Новый Структура("ИД,РодительИД,Причина,КорневаяПричина");
		ЗаполнитьЗначенияСвойств(ТемпСтрукт, СТ);
		ТемпМассив.Добавить(ТемпСтрукт);
	КонецЦикла;
	СтрФормы = Новый Структура("АнализПричины", ТемпМассив);
	ОткрытьФорму("Документ.гкс_ЕВОБланк.Форма.ПоискКорневойПричины", СтрФормы,,,,, ОпОп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьАнализПричин(Результат, ДопПараметры) Экспорт
	Если Не Результат = Неопределено Тогда 
		Объект.АнализПричины.Очистить();
		Для Каждого СМ Из Результат Цикл
			НС = Объект.АнализПричины.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СМ);
			Если СМ.КорневаяПричина Тогда 
				Объект.КорневаяПричинаТекст = СМ.Причина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура гкс_ЗаполнитьСписокУровняОстанова(ЗонаОтветственности, СписокВыбора)
	
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(1, "Остановка производства");
	СписокВыбора.Добавить(2, "Остановка оборудования со снижением производительности");
	СписокВыбора.Добавить(3, "Остановка оборудования без влияния на производство");
	
	Если ЗонаОтветственности = ПредопределенноеЗначение("Перечисление.гкс_ЗоныОтветственности.Производство")
		Или ЗонаОтветственности = ПредопределенноеЗначение("Перечисление.гкс_ЗоныОтветственности.Технология") Тогда 
		СписокВыбора.Добавить(4, "Без остановки производства");
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти
